Catalogs/КИИ_СхемыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_СхемыОтветаИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалидаторОтвета</Name>
					<Comment>Доверенный валидатор для проверки всего ответа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Свойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КИИ_ТипыПолейСхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЗначения</Name>
							<Comment>Например ДД.ММ.ГГГГ для даты</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРодителя</Name>
							<Comment>Точечный путь для вложенных свойств</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалидаторПоля</Name>
							<Comment>Доверенный валидатор для проверки поля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложеннаяСхема</Name>
							<Comment>Для типов Объект и Массив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_СхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КИИ_СхемыОтветаИИ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Валидация табличной части Свойства при записи схемы:
//  * Имя не пустое.
//  * Имя не содержит символ точки (точка зарезервирована за иерархией путей JSON).
//  * ФорматЗначения принадлежит whitelist (см. Справочники.КИИ_СхемыОтветаИИ.ДопустимыеФорматыЗначения).
//
// При нарушении — ВызватьИсключение со списком проблемных строк ТЧ, что прерывает запись.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Нарушения = Новый Массив;

	ДопустимыеФорматы = Справочники.КИИ_СхемыОтветаИИ.ДопустимыеФорматыЗначения();
	КартаДопустимыхФорматов = Новый Соответствие;

	Для Каждого Формат Из ДопустимыеФорматы Цикл
		КартаДопустимыхФорматов.Вставить(Формат, Истина);
	КонецЦикла;

	Для Каждого СтрокаСвойства Из Свойства Цикл

		Имя = СокрЛП(СтрокаСвойства.Имя);

		Если ПустаяСтрока(Имя) Тогда

			ШаблонСообщения = НСтр("ru = 'Строка %1: не задано имя свойства схемы.'");
			Нарушения.Добавить(СтрШаблон(ШаблонСообщения, СтрокаСвойства.НомерСтроки));

		ИначеЕсли СтрНайти(Имя, ".") > 0 Тогда

			ШаблонСообщения = НСтр("ru = 'Строка %1: имя ""%2"" содержит точку (зарезервирована за иерархией путей JSON).'");
			Нарушения.Добавить(СтрШаблон(ШаблонСообщения, СтрокаСвойства.НомерСтроки, Имя));

		КонецЕсли;

		ФорматЗначения = СокрЛП(СтрокаСвойства.ФорматЗначения);
		Если КартаДопустимыхФорматов.Получить(ФорматЗначения) = Неопределено Тогда

			ШаблонСообщения = НСтр("ru = 'Строка %1: формат значения ""%2"" не поддерживается. Допустимые: %3.'");
			Допустимые = СтрСоединить(ПредставлениеДопустимыхФорматов(ДопустимыеФорматы), ", ");
			Нарушения.Добавить(СтрШаблон(
				ШаблонСообщения,
				СтрокаСвойства.НомерСтроки,
				ФорматЗначения,
				Допустимые));

		КонецЕсли;

	КонецЦикла;

	Если Нарушения.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Нарушения, Символы.ПС);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеДопустимыхФорматов(ДопустимыеФорматы)

	Представления = Новый Массив;

	Для Каждого Формат Из ДопустимыеФорматы Цикл

		Если ПустаяСтрока(Формат) Тогда
			Представления.Добавить(НСтр("ru = '(пусто)'"));
		Иначе
			Представления.Добавить(СтрШаблон("""%1""", Формат));
		КонецЕсли;

	КонецЦикла;

	Возврат Представления;

КонецФункции

#КонецОбласти

#КонецЕсли
